<template>
  <div class="text-center">
    <div class="blue--text font-weight-bold text--darken-4 text-caption mt-6">
      お知らせ
    </div>
    <div class="text-h6 font-weight-black">INFORMATION</div>

    <v-dialog scrollable v-model="dialog">
      <template v-slot:activator="{ on, attrs }">
        <v-btn plain v-bind="attrs" v-on="on" class="mt-4">
          <span class="red--text text--accent-4">
            当ジムにおける感染症対策について
          </span>
          <v-icon>mdi-cursor-default-click-outline</v-icon>
        </v-btn>
      </template>

      <v-card height="600">
        <v-card-title> 新型コロナウイルス対策について </v-card-title>
        <v-divider></v-divider>
        <v-card-text class="mt-4">
          日頃よりスポーツクラブメガロスをご愛顧いただき、誠にありがとうございます。
          ご利用される皆様がより安心して施設をご利用いただくため、施設のご利用に関しては「密集」「密接」「密閉」の３つの「密」が重ならないように注意を払うとともに、手洗い・うがいの徹底やマスク（ネックゲイターを含む）の着用のほか、フィジカルディスタンス（身体的距離の確保）に配慮した対策を進めていきます。
          お客様におかれましては、ご自身の健康管理にご留意いただき、しばらくの間、館内掲示やホームページに記載の症状がある方や該当する点がある方、基礎疾患がある方は極力ご利用をお控えいただきますようお願い申し上げます。
          なお、政府の発表等により運営オペレーション等を追加・変更させていただく場合がございますので、予めご了承ください。
          お客様のご理解とご協力を賜りますようお願い申し上げます。
          （1）お客様の体調確認
          感染予防のため、しばらくの間、以下の点を厳守の上ご利用いただきますようお願い申し上げます。
          次の症状がある方など、該当する点があるお客様は、ご利用をお断りさせていただきます。
          発熱や比較的軽い風邪の症状がある方 咳・たん・胸部に不快感がある方 過去
          48 時間以内に熱があった方 だるさ（倦怠感）や息苦しさ等がある方
          味覚・嗅覚に少しでも違和感のある方
          新型コロナウイルス感染症の陽性者と濃厚接触がある方
          同居家族や身近な接触者に新型コロナウイルス感染が疑われる方がいる場合
          過去14日以内に、政府から入国制限、入国後の観察期間を必要と発表されている国・地域への渡航、或いは当該在住者、もしくは該当する方と濃厚接触がある方
          その他、同居家族や身近な接触者に上記症状がみられる方
          次の疾病や服薬中の方は新型コロナウイルスに感染した場合、重症化のリスクが高いため極力ご利用はお控えください。
          糖尿病、心不全、呼吸器疾患（COPD等）の基礎疾患がある方や透析を受けている方
          免疫抑制剤や抗がん剤等を用いている方
          高齢者の方は運動前の体調チェックと予防対策に万全を期してください。
          （2）入館時 マスク（ネックゲイターを含む）着用でご入館ください。
          混雑状況により入館制限をさせていただく場合があります。
          店舗の館内入口に設置のサーモグラフィーカメラにて測定をお願いいたします。
          ご入館時に除菌ポンプにて手指の除菌を行っていただき、館内ご利用前に手洗いをお願いいたします。
          ご入館時に体調等に関する問診を実施させていただきます。
          ロッカー内で会話をする場合は、マスク（ネックゲイターを含む）をご着用ください。
          マスク（ネックゲイターを含む）なしでの会話は禁止させていただきます。
          くしゃみや咳がでるときは、ティッシュなどで鼻と口を覆う等、咳エチケットをお願いいたします。
          地域の学校にて休業の措置が取られている学生（18歳未満）は、ご利用をご遠慮ください。
          （1）お客様の体調確認
          感染予防のため、しばらくの間、以下の点を厳守の上ご利用いただきますようお願い申し上げます。
          次の症状がある方など、該当する点があるお客様は、ご利用をお断りさせていただきます。
          発熱や比較的軽い風邪の症状がある方 咳・たん・胸部に不快感がある方 過去
          48 時間以内に熱があった方 だるさ（倦怠感）や息苦しさ等がある方
          味覚・嗅覚に少しでも違和感のある方
          新型コロナウイルス感染症の陽性者と濃厚接触がある方
          同居家族や身近な接触者に新型コロナウイルス感染が疑われる方がいる場合
          過去14日以内に、政府から入国制限、入国後の観察期間を必要と発表されている国・地域への渡航、或いは当該在住者、もしくは該当する方と濃厚接触がある方
          その他、同居家族や身近な接触者に上記症状がみられる方
          次の疾病や服薬中の方は新型コロナウイルスに感染した場合、重症化のリスクが高いため極力ご利用はお控えください。
          糖尿病、心不全、呼吸器疾患（COPD等）の基礎疾患がある方や透析を受けている方
          免疫抑制剤や抗がん剤等を用いている方
          高齢者の方は運動前の体調チェックと予防対策に万全を期してください。
          （2）入館時 マスク（ネックゲイターを含む）着用でご入館ください。
          混雑状況により入館制限をさせていただく場合があります。
          店舗の館内入口に設置のサーモグラフィーカメラにて測定をお願いいたします。
          ご入館時に除菌ポンプにて手指の除菌を行っていただき、館内ご利用前に手洗いをお願いいたします。
          ご入館時に体調等に関する問診を実施させていただきます。
          ロッカー内で会話をする場合は、マスク（ネックゲイターを含む）をご着用ください。
          マスク（ネックゲイターを含む）なしでの会話は禁止させていただきます。
          くしゃみや咳がでるときは、ティッシュなどで鼻と口を覆う等、咳エチケットをお願いいたします。
          地域の学校にて休業の措置が取られている学生（18歳未満）は、ご利用をご遠慮ください。
        </v-card-text>
      </v-card>
    </v-dialog>
    <v-divider class="mt-6"></v-divider>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from 'vue-property-decorator'

@Component
export default class BbInfo extends Vue {
  private dialog: boolean = false
}
</script>

<style lang="scss"></style>
